run/tutorials/combustion/fireFoam/les/smallPoolFire2D/0/N2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.76699;

boundaryField
{
    outlet
    {
        type            calculated;
    }
    sides
    {
        type            calculated;
    }
    base
    {
        type            calculated;
    }
    inlet
    {
        type            calculated;
    }
    frontBack
    {
        type            empty;
    }
}


// ************************************************************************* //
